---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamLiquidViscosity
source: html/5c949009-22c5-df87-72c7-e8a8c88aa26b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamLiquidViscosity Property

"Liquid Viscosity"

## Syntax (C#)
```csharp
public static ForgeTypeId ThermalMaterialParamLiquidViscosity { get; }
```